Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: OpenTelemetry Extension
ja_jp: OpenTelemetry エクステンション

source: OpenTelemetry Logging is able to send logs to a compatible OpenTelemetry collector. Its usage is described in the guide xref:opentelemetry-logging.adoc[Using OpenTelemetry Logging].
ja_jp: OpenTelemetry Loggingは、互換性のある OpenTelemetry コレクターにログを送信できます。その使用方法は、ガイド xref:opentelemetry-logging.adoc[OpenTelemetry Loggingの使用] に記載されています。

source: OpenTelemetry Logging is considered _tech preview_ and is disabled by default.
ja_jp: OpenTelemetry Logging は _tech preview_ とみなされ、デフォルトでは無効になっています。

source: OpenTelemetry Metrics and Logging are not yet supported.
ja_jp: OpenTelemetry MetricsとLoggingはまだサポートされていません。

source: OpenTelemetry Metrics is considered _tech preview_ and is disabled by default.
ja_jp: OpenTelemetry メトリクスは _テクノロジープレビュー_ とみなされており、デフォルトでは無効になっています。

source: OpenTelemetry Metrics vs Micrometer Metrics
ja_jp: OpenTelemetry メトリクスと Micrometer メトリクス

source: OpenTelemetry is now supported via two new extensions.
ja_jp: OpenTelemetryは、2つの新しいエクステンションを通じてサポートされています。

source: OpenTelemetry logging
ja_jp: OpenTelemetry ログ

source: OpenTelemetry logs are disabled by default in the `quarkus-opentelemetry` extension, but enabled by default in the `quarkus-micrometer-opentelemetry` extension.
ja_jp: OpenTelemetry ログは、`quarkus-opentelemetry` エクステンションではデフォルトで無効になっていますが、`quarkus-micrometer-opentelemetry` エクステンションではデフォルトで有効になっています。

source: OpenTelemetry metrics auto-instrumentation for HTTP server and JVM metrics are disabled by default because those metrics can be collected by Micrometer.
ja_jp: HTTP サーバーおよび JVM メトリクスの OpenTelemetry メトリクス自動計装は、Micrometer によって収集できるため、デフォルトでは無効になっています。

source: OpenTelemetry propagates cross-cutting concerns through https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[propagators] that will share an underlying `Context` for storing state and accesing data across the lifespan of a distributed transaction.
ja_jp: OpenTelemetryは、分散型トランザクションの寿命を超えて状態を保存し、データにアクセスするための基礎となる `Context` を共有する link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[プロパゲータ]を通じて、横断的な関心を伝播します。

source: OpenTelemetry propagates cross-cutting concerns through https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[propagators] that will share an underlying `Context` for storing state and accessing data across the lifespan of a distributed transaction.
ja_jp: OpenTelemetry は、 https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/context/api-propagators.md[プロパゲーター] を介して分野横断的な関心事を伝播し、状態を保存するための基になる `Context` を共有し、分散トランザクションの存続期間全体にわたってデータにアクセスします。

source: OpenTelemetry provides a set of https://opentelemetry.io/docs/specs/semconv/http/http-spans/[semantic conventions] to standardize the data collected by the instrumentation.
ja_jp: OpenTelemetry は、計装によって収集されたデータを標準化するための https://opentelemetry.io/docs/specs/semconv/http/http-spans/[セマンティック規約] のセットを提供します。

source: OpenTelemetry provides many other types of Counters: `LongUpDownCounter`, `DoubleCounter`, `DoubleUpDownCounter` and also Observable, async counters like `ObservableLongCounter`, `ObservableDoubleCounter`, `ObservableLongUpDownCounter` and `ObservableDoubleUpDownCounter`.
ja_jp: OpenTelemetry は、 `LongUpDownCounter`、 `DoubleCounter`、 `DoubleUpDownCounter` などの他の多くのタイプのカウンターと、 `ObservableLongCounter`、 `ObservableDoubleCounter`、 `ObservableLongUpDownCounter`、 `ObservableDoubleUpDownCounter` などの Observable の非同期カウンターも提供します。

source: OpenTelemetry provides many other types of Counters: `LongUpDownCounter`, `DoubleCounter`, `UpDownCounter`, `DoubleUpDownCounter` and also Observable, async counters like `ObservableLongCounter`, `ObservableDoubleCounter`, `ObservableLongUpDownCounter` and `ObservableDoubleUpDownCounter`.
ja_jp: OpenTelemetry は、`LongUpDownCounter`、`DoubleCounter`、`UpDownCounter`、`DoubleUpDownCounter` など、他にも多くの種類のカウンターを提供しています。また、`ObservableLongCounter`、`ObservableDoubleCounter`、`ObservableLongUpDownCounter`、`ObservableDoubleUpDownCounter` など、Observable な非同期カウンターも提供します。

source: OpenTelemetry uses their own https://opentelemetry.io/docs/specs/semconv/[Semantic Conventions] to name metrics and attributes.
ja_jp: OpenTelemetry は、メトリクスと属性に名前を付けるために独自の https://opentelemetry.io/docs/specs/semconv/[セマンティック規則] を使用します。

source: OpenTracing has been deprecated in favor of OpenTelemetry. For tracing information, please check the related section about <<datasource-tracing>>, bellow.
ja_jp: OpenTracing は非推奨となり、OpenTelemetry が選ばれました。トレース情報については、 <<datasource-tracing>> の関連セクションを参照してください。

source: Opens a dialog with all information
ja_jp: すべての情報を含むダイアログを開きます

source: Openshift will automatically create the `openshift-user-workload-monitoring` namespace and deploy the required resources for Prometheus to it.
ja_jp: Openshiftは自動的に `openshift-user-workload-monitoring` 名前空間を作成し、そこにPrometheusに必要なリソースをデプロイします。

source: Opentelemetry Config
ja_jp: Opentelemetry設定

source: Operands are first tested using the `java.util.Objects#equals(Object, Object)` method. If it returns `true` the operands are considered equal.
ja_jp: オペランドは、まず `java.util.Objects#equals (Object、Object)` メソッドを使用してテストされます。`true` が返された場合、オペランドは等しいとみなされます。

source: Operating system details: OS name, OS version and architecture
ja_jp: オペレーティングシステムの詳細: OS名、OSバージョン、アーキテクチャ

source: Operations
ja_jp: 操作

source: Operations without any profile are always *included*.
ja_jp: プロファイルのないオペレーションは常に *含まれます*。

source: Operator
ja_jp: オペレーター

source: Operators for Reactive Streams programming
ja_jp: Reactive Streams プログラミングのためのオペレーター

source: Operators that support the service auto-binding
ja_jp: サービス auto-binding をサポートするオペレーター

source: Opinionated
ja_jp: 定見に基づいた選択

source: OptaPlanner - Using AI to optimize a schedule with OptaPlanner
ja_jp: OptaPlanner - OptaPlanner での AI を使用したスケジュールの最適化

source: Optimistic Fallback ID Handler
ja_jp: Optimistic フォールバック ID ハンドラー

source: Optimistic concurrency control is not available at the moment.
ja_jp: 楽観的並行性制御は現在利用できません。

source: Optimistic locking
ja_jp: 楽観的ロック

source: Optimized Resource Consumption
ja_jp: 最適化されたリソース消費

source: Optimizing the Native Image
ja_jp: ネイティブイメージの最適化

source: Optional
ja_jp: オプション

source: Optional Configuration Groups
ja_jp: オプション設定グループ

source: Optional Step: using the MANDATORY element
ja_jp: オプショナルステップ：MANDATORY要素の使用

source: Optional Values
ja_jp: オプション値

source: Optional config property overriden with empty value as discussed in https://groups.google.com/g/Quarkus-dev/c/_g-6qfUFA3A/m/2s9XjTVxAwAJ[this thread]
ja_jp: link:https://groups.google.com/g/Quarkus-dev/c/_g-6qfUFA3A/m/2s9XjTVxAwAJ[このスレッド]で議論されているように、オプションの設定プロパティが空の値で上書きされます。

source: Optional containers: `java.util.Optional`, `java.util.OptionalInt`, `java.util.OptionalLong`, and `java.util.OptionalDouble`
ja_jp: オプションのコンテナー: `java.util.Optional`、 `java.util.OptionalInt`、 `java.util.OptionalLong`、および `java.util.OptionalDouble`

source: Optional filter if this action only applies to certain items. Takes a regex as input, and some predefined regexes exisits in the the `Patterns` class
ja_jp: このアクションが特定の項目にのみ適用される場合のオプションのフィルター。正規表現を入力として受け取り、いくつかの事前定義された正規表現が `Patterns` クラスに存在します。

source: Optional gRPC headers commonly used for authentication
ja_jp: 認証によく使われるオプションのgRPCヘッダー

source: Optional gRPC headers commonly used for authentication.
ja_jp: 認証によく使われるオプションの gRPC ヘッダー

source: Optional injection using `@Autowired(required=false)` is not supported. Use `javax.enterprise.inject.Instance` and then test `Instance.isResolvable()`.
ja_jp: `@Autowired(required=false)` を使用したオプショナルな注入はサポートされていません。 `javax.enterprise.inject.Instance` を使用し、その後 `Instance.isResolvable()` をテストしてください。

source: Optional parameter declaration. Qute attempts to validate all expressions that reference the parameter `item`.
ja_jp: オプションのパラメーター宣言。Qute は、パラメーター `item` を参照するすべての式の検証を試みます。

source: Optional values
ja_jp: オプション値

source: Optional: An additional prerequisite not covered by the attributes
ja_jp: オプション: 属性でカバーされていない追加の前提条件

source: Optional: An attribute that modifies the prerequisites
ja_jp: オプション: 前提条件を変更する属性

source: Optional: Build Time Data
ja_jp: オプション: ビルド時データ

source: Optional: Labels
ja_jp: オプション: ラベル

source: Optional: Library Version
ja_jp: オプション: ライブラリーバージョン

source: Optional: Set the following properties in the `application.properties` file based on your environment:
ja_jp: オプション: 環境に基づいて、 `application.properties` ファイルに以下のプロパティーを設定します:

source: Optional: Set the following properties in the `application.properties` file, based on your environment:
ja_jp: オプション：ご使用の環境に応じて、 `application.properties` ファイルに以下のプロパティを設定してください：

source: Optional: To import a custom realm file into Keycloak before running the tests, configure `Dev services for Keycloak`:
ja_jp: オプション: テストを実行する前にカスタムレルムファイルを Keycloak にインポートするには、`Dev Services for Keycloak` を次のように設定します。

source: Optional: To specify a particular stream, use the `--stream` option; for example: `--stream=3.2`
ja_jp: オプション：特定のストリームを指定するには、 `--stream` オプションを使用します。例: `--stream=3.2`

source: Optional: To specify a particular stream, use the `-Dstream` option; for example: `-Dstream=3.2`
ja_jp: オプション：特定のストリームを指定するには、 `-Dstream` オプションを使用します。例: `-Dstream=3.2`

source: Optional: To specify a particular stream, use the `Dstream` option; for example: `-Dstream=3.0`
ja_jp: オプション：特定のストリームを指定するには、 `Dstream` オプションを使用します。例: `-Dstream=3.0`

source: Optional: To specify a particular stream, use the `stream` option; for example: `--stream=3.0`
ja_jp: オプション：特定のストリームを指定するには、 `stream` オプションを使用します。例: `--stream=3.0`

source: Optional: You have a Quarkus Maven project that includes the `quarkus-openshift` extension.
ja_jp: オプション：Quarkus Mavenプロジェクトに `quarkus-openshift` エクステンションが含まれていること

source: Optional: You have a Quarkus project that includes the `quarkus-openshift` extension.
ja_jp: オプション：Quarkusプロジェクトに `quarkus-openshift` エクステンションが含まれていること

source: Optionally Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately] if you want to build a native executable (or Docker if you use a native container build)
ja_jp: ネイティブ実行可能ファイルをビルドしたい場合、MandrelまたはGraalVM（あるいはネイティブなコンテナビルドを使用する場合はDocker）をインストールし、 link:building-native-image.html#configuring-graalvm[適切に設定]していること

source: Optionally enable proactive authentication. The best possible results are achieved when proactive authentication is enabled because the authentication happens sooner. A good way to determine whether proactive authentication should be enabled in your Quarkus application is to read the Quarkus xref:security-proactive-authentication.adoc[Proactive authentication] guide.
ja_jp: 必要に応じて、プロアクティブ認証を有効にします。 プロアクティブ認証を有効にすると、認証がより早く行われるため、最良の結果が得られます。 Quarkus アプリケーションでプロアクティブ認証を有効にする必要があるかどうかを判断する良い方法は、Quarkus の xref:security-proactive-authentication.adoc[プロアクティブ認証] ガイドを読むことです。

source: Optionally get <a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} for native compilation
ja_jp: オプションとして、ネイティブコンパイルには<a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} が必要です

source: Optionally only show certain fields.
ja_jp: オプションで特定のフィールドのみを表示します。

source: Optionally provided to indicate that the latest revision should be used for this traffic target
ja_jp: この Traffic ターゲットに最新のリビジョンを使用することを示すためにオプションで提供される

source: Optionally some templates that are following a common structure and naming conventions
ja_jp: 共通の構造と命名規則に従ったいくつかのテンプレート（オプション）

source: Optionally the xref:cli-tooling.adoc[Quarkus CLI] if you want to use it
ja_jp: 使用したい場合は、 link:cli-tooling.html[Quarkus CLI]

source: Optionally use a BOM file to omit the version of the different Quarkus dependencies.
ja_jp: オプションで、BOMファイルを使用して、異なるQuarkus依存関係のバージョンを省略することができます。

source: Optionally, Add the `index.html` section template (<<index-html>>).
ja_jp: オプションで、 `index.html` セクションテンプレート（ link:#index-html[index-html]）を追加します。

source: Optionally, add some resources (`./base` directory if they are non language specific)
ja_jp: オプションで、いくつかのリソースを追加します（言語に依存しない場合は `./base` ディレクトリ）。

source: Optionally, add the <<app-config>>.
ja_jp: オプションで、 link:#app-config[app-config]を追加します。

source: Optionally, but highly recommended, you should define a proper size for your connection pool.
ja_jp: 任意ですが、接続プールの適切なサイズを定義することを強くお勧めします。

source: Optionally, customize client and connection options not configurable with the connector API or Quarkus configuration.
ja_jp: オプションで、コネクター API または Quarkus 設定では設定できないクライアントおよび接続オプションをカスタマイズできます。

source: Optionally, implement a custom mechanism to reload the certificates when the secret is updated. See <<reloading-certificates>> for more information.
ja_jp: 必要に応じて、シークレットが更新されたときに証明書を再読み込みするカスタムメカニズムを実装します。 詳細は <<reloading-certificates>> を参照してください。

source: Optionally, the native build process can generate reports that show what goes into the binary:
ja_jp: オプションとして、ネイティブビルドプロセスでは、バイナリに何が入っているかを示すレポートを生成することができます。

source: Optionally, use `application.yaml` instead of `application.properties` to configure your application.
ja_jp: オプションとして、 `application.properties` の代わりに `application.yaml` を使用してアプリケーションを設定することもできます。

source: Optionally, use application.yaml instead of application.properties to configure your application.
ja_jp: アプリケーションの設定には、application.propertiesの代わりにapplication.yamlを使用することもできます。

source: Optionally, use the `@MongoEntity` annotation to specify the name of the collection, the name of the database or the name of the client.
ja_jp: オプションとして、 `@MongoEntity` アノテーションを使用して、コレクションの名前、データベースの名前、またはクライアントの名前を指定します。

source: Optionally, you can add, remove, or modify the default prerequisites by inserting the following attributes on the line before the `include::{includes}/prerequisites.adoc[]` macro.
ja_jp: オプションで、 `include::{includes}/prerequisites.adoc[]` マクロ の前の行に次の属性を挿入することで、デフォルトの前提条件を追加、削除、または変更できます。

source: Optionally, you can enable these callbacks also for the `@QuarkusIntegrationTest` tests if the property `quarkus.test.enable-callbacks-for-integration-tests` is `true`.
ja_jp: オプションとして、プロパティ `quarkus.test.enable-callbacks-for-integration-tests` を `true` とすることで、これらのコールバックを `@QuarkusIntegrationTest` テストでも有効にすることができます。

source: Optionally, you can register this Keycloak SAML provider as a default provider by navigating to `Authentication/browser/Identity Provider Redirector config` and setting both the `Alias` and `Default Identity Provider` properties to `saml`. If you do not configure it as a default provider, then, at authentication time, Keycloak offers 2 options:
ja_jp: 必要に応じて、この Keycloak SAML プロバイダーをデフォルトプロバイダーとして登録できます。それには、 `Authentication/browser/Identity Provider Redirector config` に移動し、 `Alias` プロパティーと `Default Identity Provider` プロパティーの両方を `saml` に設定します。 デフォルトプロバイダーとして設定しない場合、認証時に Keycloak は 2 つのオプションを提供します。

source: Options to control maximum heap size, young space and other typical use cases found in the JVM can be found in https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[the GraalVM memory management guide]. Setting the maximum heap size, either as a percentage or an explicit value, is generally recommended.
ja_jp: 最大ヒープサイズ、ヤングスペース、およびJVMで見られる他の典型的なユースケースを制御するためのオプションは、 link:https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[GraalVMメモリ管理ガイド] で見つけることができます。パーセンテージまたは明示的な値として、最大ヒープサイズを設定することは、一般的に推奨されます。

source: Or a custom start-up script can be created and referenced on the properties file. This approach works better if there's a need to set application params using environment variables:
ja_jp: または、カスタムスタートアップスクリプトを作成し、プロパティファイルで参照することもできます。この方法は、環境変数を使用してアプリケーションのパラメータを設定する必要がある場合に有効です。

source: Or adding this to the `application.properties` file:
ja_jp: または、 `application.properties` ファイルにこれを追加します。

source: Or better yet, run the application in dev mode: `mvn clean quarkus:dev`.
ja_jp: または、 `mvn clean quarkus:dev` でアプリケーションを開発モードで実行します。

source: Or by name using a `Map`:
ja_jp: または、 `Map` を使った名前で:

source: Or by using the `@WithOpenShiftTestServer` similar to the `@WithKubernetesTestServer` explained in the previous section:
ja_jp: または、前のセクションで説明した `@WithKubernetesTestServer` と同様の `@WithOpenShiftTestServer` を使用することによって:

source: Or configured globally using `pulsar.client` prefix:
ja_jp: または、 `pulsar.client` 接頭辞を使用してグローバルに設定します。

source: Or constructor injection:
ja_jp: あるいはコンストラクター注入も可能です:

source: Or disable Java options provided by specific extensions by configuring Maven coordinates patterns, such as
ja_jp: または、Maven 座標パターンを設定することで、特定のエクステンションが提供する Java オプションを無効にできます。

source: Or even on your endpoint constructor:
ja_jp: または、エンドポイントコンストラクターでも:

source: Or fetching the contents from a URL:
ja_jp: または、URL からコンテンツを取得します。

source: Or generate `COUNT` queries
ja_jp: または `COUNT` クエリを生成する

source: Or have the listener’s name be the same as the group id:
ja_jp: または、リスナーの名前をグループ ID と同じにします:

source: Or if you are on another page (not one of yours) you can get the pages for your namespace
ja_jp: または、別のページ (自分のページではない) にいる場合は、自分の名前空間のページを取得できます

source: Or if you prefer, in another terminal, run:
ja_jp: または、必要に応じて、別のターミナルで次を実行します:

source: Or if you want to create a translation for a new language, copy one of the above repositories and check out the README for more details.
ja_jp: または、新しい言語の翻訳を作成する場合は、上記のリポジトリのいずれかをコピーし、README で詳細を確認してください。

source: Or in `application.yml`:
ja_jp: あるいは、 `application.yml` で次のように設定します。

source: Or into any kind of test, either as a field or test parameter:
ja_jp: または、フィールドまたはテストパラメーターとして、あらゆる種類のテストにインジェクションできます。

source: Or just add the following dependency to your project:
ja_jp: もしくは、以下の依存関係をプロジェクトに追加します:

source: Or plain text:
ja_jp: またはプレーンテキスト:

source: Or programmatically using the `.register()` method:
ja_jp: または、 `.register()` メソッドをプログラムで使用します。

source: Or programmatically:
ja_jp: または、プログラムで設定することもできます。

source: Or projections of a single column, even multiple columns with `Object[]` and `List<Object[]>` types
ja_jp: または単一カラムのプロジェクション、さらに `Object[]` および `List<Object[]>` 型を使用した複数カラムのプロジェクションも可能

source: Or single entities, and any number of parameters which must all match the queried entities.
ja_jp: または単一のエンティティ、およびクエリ対象のエンティティすべてに一致する必要がある任意の数のパラメーター

source: Or start `gdb` with:
ja_jp: または、 `gdb` を以下のように起動してください:

source: Or take a look into the World of Warcraft Auctions - Batch Application. It downloads the World of Warcraft Auction House data and provides statistics about items prices.
ja_jp: または、World of Warcraft Auctions - Batch Application を参照してください。これは World of Warcraft Auction House のデータをダウンロードし、アイテムの価格に関する統計を提供します。

source: Or using the convenience class `Parameters` either as is or to build a `Map`:
ja_jp: または便利なクラスである `Parameters` をそのまま使用するか、 `Map` を構築する。

source: Or with SSL:
ja_jp: SSLを利用する場合

source: Or with TLS/SSL:
ja_jp: TLS/SSL の場合:

source: Or with the secret retrieved from a xref:credentials-provider.adoc[CredentialsProvider], signature algorithm is `HS256`:
ja_jp: または xref:credentials-provider.adoc[CredentialsProvider] から取得した秘密鍵で、署名アルゴリズムは `HS256` です。

source: Or with the secret retrieved from a xref:credentials-provider.adoc[CredentialsProvider]:
ja_jp: または、xref:credentials-provider.adoc[クレデンシャルプロバイダー] から取得したシークレットを使用します。

source: Or wrap the `String` value in a `io.quarkus.qute.RawString`.
ja_jp: `String` の値を `io.quarkus.qute.RawString` でラップします。

source: Or you can configure it globally on all channels of a connector:
ja_jp: または、コネクターのすべてのチャネルでグローバルに設定することもできます。

source: Or you can directly receive the list of payloads to the consume method:
ja_jp: または、consume メソッドにペイロードのリストを直接受信することもできます。

source: Or you can take full control of the UI and produce a `FooterPageBuildItem` and provide a custom web component in a js file:
ja_jp: または、UI を完全に制御し、`FooterPageBuildItem` を生成し、js ファイルでカスタム Web コンポーネントを提供することもできます。

source: Or you can use `@NonBlocking`:
ja_jp: または、 `@NonBlocking` を使用することもできます:

source: Or you can use `CompletionStage`:
ja_jp: または、 `CompletionStage` を使用することもできます。

source: Or, if you don't have GraalVM installed, you can instead use Docker to build the native executable using:
ja_jp: あるいは、GraalVMをインストールしていない場合は、代わりにDockerを使ってネイティブ実行可能ファイルをビルドすることもできます:

source: Or, if you need more flexibility, write a <<jose4j-validator-bearer>>:
ja_jp: あるいは、より柔軟性が必要な場合は、<<jose4j-validator-bearer>> を作成してください:

source: Or, if you need to customise the endpoints:
ja_jp: または、エンドポイントをカスタマイズする必要がある場合は、以下のようになります。

source: Or, if you packaged your application as native executable, use:
ja_jp: あるいは、アプリケーションをネイティブ実行可能ファイルとしてパッケージ化する場合は、次を使用します。

source: Or, we can also dump it with the `jcmd` command.
ja_jp: または、 `jcmd` コマンドを使用してダンプすることもできます。

source: Or, you can also install the CLI with SDKMAN!
ja_jp: あるいは、SDKMAN! を使用して CLI をインストールすることもできます。

source: Or, you can retrieve the Message<Double>:
ja_jp: または、Message<Double> を取得できます。

source: Or, you can retrieve the Reactive Messaging type `Message<Double>`:
ja_jp: または、Reactive Messaging タイプ `Message<Double>` を取得することもできます。

source: Or:
ja_jp: あるいは:

source: Oracle Client
ja_jp: Oracleクライアント

source: Oracle Express Edition (container)
ja_jp: Oracle Express Edition (コンテナー)

source: Oracle JDBC driver extension
ja_jp: Oracle JDBCドライバエクステンション

source: Oracle Reactive SQL Client
ja_jp: Oracle Reactive SQL クライアント

source: Oracle considerations
ja_jp: Oracle に関する考慮事項

source: Oracle: Multiple schemas in Dev Services
ja_jp: Oracle: Dev Services での複数スキーマ

source: Orchestration of the initialization tasks
ja_jp: 初期化タスクのオーケストレーション

source: Ordering Services
ja_jp: サービスの順序付け

source: Ordinal
ja_jp: 序列

source: Organise your template files in the `/src/main/resources/templates` directory, by grouping them into one directory per resource class. So, if your `ItemResource` class references two templates `hello` and `goodbye`, place them at `/src/main/resources/templates/ItemResource/hello.txt` and `/src/main/resources/templates/ItemResource/goodbye.txt`. Grouping templates per resource class makes it easier to navigate to them.
ja_jp: テンプレートファイルを `/src/main/resources/templates` ディレクトリーに整理し、リソースクラスごとに 1 つのディレクトリーにグループ化します。つまり、 `ItemResource` クラスが `hello` と `goodbye` の 2 つのテンプレートを参照している場合は、 `/src/main/resources/templates/ItemResource/hello.txt` と `/src/main/resources/templates/ItemResource/goodbye.txt` に配置します。リソースクラスごとにテンプレートをグループ化することで、テンプレートへのナビゲートが容易になります。

source: Organize your template files in the `/src/main/resources/templates` directory, by grouping them into one directory per resource class. So, if your `FruitResource` class references two templates `apples` and `oranges`, place them at `/src/main/resources/templates/FruitResource/apples.txt` and `/src/main/resources/templates/FruitResource/oranges.txt`. Grouping templates per resource class makes it easier to navigate to them.
ja_jp: テンプレートファイルを `/src/main/resources/templates` ディレクトリーに整理し、リソースクラスごとに 1 つのディレクトリーにグループ化します。 `FruitResource` クラスが `apples` と `oranges` の 2 つのテンプレートを参照している場合は、これらを `/src/main/resources/templates/FruitResource/apples.txt` と `/src/main/resources/templates/FruitResource/oranges.txt` に配置します。リソースクラスごとにテンプレートをグループ化すると、テンプレートへの移動が容易になります。

source: Origin
ja_jp: 起源

source: Other CDI beans can be injected for runtime access to keystore material.
ja_jp: キーストアマテリアルへの実行時アクセスのために、他の CDI Bean を注入できます。

source: Other CDI beans can be injected for runtime access to truststore material.
ja_jp: トラストストアマテリアルへの実行時アクセスのために、他の CDI Bean を注入できます。

source: Other Changes
ja_jp: その他の変更点

source: Other Configurations
ja_jp: その他の設定

source: Other Grants
ja_jp: その他の助成金
